var config = {
    /*在这里配置你的基本信息，所有数据以字符串形式给出*/
    name: "高瑞卿",
    sex: "男",
    age: "28",
    phone: "187292880347",
    email: "1004938890@qq.com",
    address: "陕西省西安市灞桥区",
    qq: "1004938890",
    log: "SmallGao",
    excpect_work: "引擎开发工程师",


    /*在这里配置首页的座右铭集合*/
    motto: [
        "明天不一定会更好，但要坚信更好的明天一定会来。",
        "要做的事情总找得出时间和机会，不愿意做的事情也总能找得出借口。",
        "Gor For It!",
        "有智者立长志，无志者长立志。",
        "那些过去的眼泪终将风干在记忆里。",
        "真相，是为了剿灭幻想。",
        "我欲将心向明月，奈何明月照沟渠。",
        "春风得意马蹄疾，一日看尽长安花。",
        "天凉好个秋！",
        "老骥伏枥，志在千里。烈士暮年，壮心不已。",
        "老当益壮，宁移白首之心。穷且益坚，不坠青云之志。",
        "我们必须拿我们所有的， 去换我们所没有的",
        "蒹葭苍苍，白露为霜；所谓伊人，在水一方。",
        "数风流人物，还看今朝！"
    ],


    /*在这里配置首页的见面信息，你可以内嵌HTML标签以调整格式*/
    welcome: "青青子衿，悠悠我心<br>" +
             "但为君故，沉吟至今<br>" +
             "你好，我是高瑞卿<br>" +
             "很高兴见到你!",


    /*在这里配置关于我的信息，你可以内嵌HTML标签以调整格式*/
    about: "<p>你好！我叫高瑞卿。我期望的工作岗位是虚幻引擎开发工程师。</p>" +
        "<p>我计算机基础知识掌握扎实，能够在工作中很好的完成自己的任务。此外，我有着充满激情的工作态度，团队协同作战能力强，同时我也具备独立开发的能力，擅于发现并解决问题。我的执行力强、责任感高、集体荣誉感强、敢于担当，能够接受加班或出差等安排</p>" +
        "<p>十分期待与您的联系!</p>",


    /** 
    * 在这里配置你的技能点
    * ["技能点", 掌握程度, "技能条颜色"]
    */  
    skills: [
        ["C++", 80, "red"],
        ["Blueprint", 77, "blue"],
        ["SQL", 75, "#1abc9c"],
        ["CSS3", 60, "yellow"],
        ["JavaScript", 70, "pink"]
    ],


    /*这里填写你的技能描述，你可以内嵌HTML标签以调整格式*/
    skills_description: "<ul>" +
        "     <li>可以使用虚幻引擎独立完成客户端相关功能模块开发</li>" +
        "     <li>熟练使用虚幻引擎蓝图模块，可以使用蓝图和C++协作开发</li>" +
        "     <li>能够快速的熟悉以及应用相关插件，可以独立开发应用插件</li>" +
        "     <li>可以搭建和优化项目软件框架，完善开发规范</li>" +
        "     <li>在引擎源码基础上进行相应的技术突破</li>" +
        "     <li>拥有三年以上的引擎主程经验，擅长数字孪生领域产品开发</li>" +
        " </ul>",


    /**
     * 这里填写你的个人作品展示
     * ["img"，"url", "ProjectName", "brief"]
     * img表示您的作品图片链接，url表示您的项目地址，ProjectName表示您的仓库或作品名称，brief是一句简短的介绍
     * 通过查看实际效果以调整字题长度
     */
    portfolio: [
        ["./ProAssets/智慧社区001.png", "./ProAssets/智慧社区.mp4", "智慧社区"],
        ["./ProAssets/智慧城市001.png", "./ProAssets/智慧城市.mp4", "智慧城市"],
        ["./ProAssets/智慧发电站003.jpg", "./ProAssets/智慧发电站.mp4", "智慧发电站"]
    ],


    /**
     * 这里填写您的工作经历
     * ["日期"， "工作"， "介绍"]
     * 你可以内嵌HTML标签以排版格式
     */
    work: [
        //如果您内有工作经历，您可以采取下列写法
        // ["————————", "", "<p>暂无工作经历，期待您的联系。</p>"]

        ["2019/10/8 — 2020/4/30", "<br>前端开发工程师",
            "<p><strong>前端开发部</strong></p>" +
            "<p>1.负责航天智慧城市通用后台的开发</p>" +
            "<p>2.使用thinjs开发智慧园区，智慧公园</p>"
        ],
        ["2020/5/1 — 2023/10/8", "<br>引擎开发工程师",
            "<p><strong>引擎开发部</strong></p>" +
            "<p>1.数字孪生项目的开发</p>" 
        ],

    ],


    /**
     * 这里填写你的其他经历
     * ["日期"， "经历"， "介绍"]
     * 建议填写您的校级及以上得奖经历或或其他证书
     */
    others: [
        ["2019-10-08", "航天智慧城市", "使用WEBGL技术，实现3D可视化"],
        ["2020-05-01", "智慧城市", ""],
        ["2020-09-01", "智慧博物馆", ""],
        ["2020-11-01", "智慧社区", ""],
        ["2021-05-1", "智慧园区", ""],
        ["2021-09-13", "智慧公安", ""],
        ["2021-12-13", "综管平台", ""],
        ["2022-04-13", "智慧楼宇", ""],
        ["2023-05-08", "智慧发电站", ""]
    ],


    //这是一些图片链接，建议您仅更改第二个头像图片
    url: [
        //背景图、头像、作品展示背景、其他经历背景
        "./images/intro-bg.jpg",
        "./images/1.png",
        "./images/work-bk.png",
        "./images/4.jpg"
    ]

}